Wavetrend/RX14XX-TestApp/main.c
/**
  Generated main.c file from MPLAB Code Configurator

  @Company
    Microchip Technology Inc.

  @File Name
    main.c

  @Summary
    This is the generated main.c using PIC24 / dsPIC33 / PIC32MM MCUs.

  @Description
    This source file provides main entry point for system initialization and application code development.
    Generation Information :
        Product Revision  :  PIC24 / dsPIC33 / PIC32MM MCUs - 1.145.0
        Device            :  PIC24FJ256GB206
    The generated drivers are tested against the following:
        Compiler          :  XC16 v1.36b
        MPLAB 	          :  MPLAB X v5.25
*/

/*
    (c) 2019 Microchip Technology Inc. and its subsidiaries. You may use this
    software and any derivatives exclusively with Microchip products.

    THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER
    EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED
    WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A
    PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION
    WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION.

    IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE,
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND
    WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS
    BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE
    FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN
    ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
    THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.

    MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE
    TERMS.
*/

/**
  Section: Included Files
*/
#include <stdio.h>
#include <stdbool.h>

#include <xc.h>
#include "mcc_generated_files/system.h"

#include "utlist.h"

#include "wtapi_circular_buffer.h"
#include "wt_assert.h"
#include "wt_error.h"

/*
                         Main application
 */

WTAPI_DECLARE_CIRCULAR_BUFFER(uint8_t, wt_rx14xx_uint8_buffer);
WTAPI_DEFINE_CIRCULAR_BUFFER(uint8_t, wt_rx14xx_uint8_buffer);

////////////////////////////////// TMR ///////////////////////////////////////

typedef struct {
    
    bool (*start)(void * const context, uint32_t const msecs, wt_error_t * const error);
    bool (*stop)(void * const context, wt_error_t * const error);
    
} wthal_timer_impl_t;

typedef struct {
    
    wthal_timer_impl_t * impl;
    void * context;
    
} wthal_timer_t;

wthal_timer_t * const wthal_timer_init(wthal_timer_t * const self, wthal_timer_impl_t * const impl, void * const context, wt_error_t * const error) {
    bool ok = true;
    ok = !ok ? ok : wt_assert_ptr(self, error);
    ok = !ok ? ok : wt_assert_ptr(impl, error);
    
    if (ok) {
        self->impl = impl;
        self->context = context;
    }
    
    return ok ? self : NULL;
}

bool wthal_timer_start(wthal_timer_t * const self, uint32_t const msecs, wt_error_t * const error) {
    bool ok = true;
    ok = !ok ? ok : wt_assert_ptr(self, error);
    ok = !ok ? ok : wt_assert_ptr(self->impl->start, error);
    
    return !ok ? ok : self->impl->start(self->context, msecs, error);
}

bool wthal_timer_stop(wthal_timer_t * const self, wt_error_t * const error) {
    bool ok = true;
    ok = !ok ? ok : wt_assert_ptr(self, error);
    ok = !ok ? ok : wt_assert_ptr(self->impl->start, error);

    return !ok ? ok : self->impl->stop(self->context, error);
}

//---------------------------------
// XTAL 14745600

typedef enum { 
    wt_rx14xx_timer_prescale_1 = 0,
    wt_rx14xx_timer_prescale_8 = 1,
    wt_rx14xx_timer_prescale_64 = 2,
    wt_rx14xx_timer_prescale_256 = 3,
} wt_rx14xx_timer_prescale_t;

#define DEFINE_TIMER(NAME, XTAL, TIMER, PERIOD, TON, TCKPS, IF) \
    typedef struct { \
        wthal_timer_t timer; \
    } NAME ## _t; \
    static bool start_impl(void * const context, uint32_t const msecs, wt_error_t * const error) { \
        float prescale[4] = { 1, 8, 64, 256 }; \
        bool ok = false; \
        TON = 0; \
        for (size_t i=0 ; i < sizeof(prescale) / sizeof(float) ; i++) { \
            uint32_t period = (((XTAL / 2) / prescale[i]) / 1000) * msecs; \
            if (period <= UINT16_MAX) { \
                TCKPS = i; \
                PERIOD = (uint16_t)period; \
                TIMER = 0; \
                IF = 0; \
                TON = 1; \
                ok = true; \
                break; \
            } \
        } \
        ok = wt_assert(ok, WT_ERROR_EINVAL, error); \
        return ok; \
    } \
    static bool stop_impl(void * const context, wt_error_t * const error) { \
        TON = 0; \
        return true; \
    } \
    static wthal_timer_impl_t NAME ## _impl = { \
        .start = start_impl, \
        .stop = stop_impl, \
    }; \
    wthal_timer_t * const NAME ## _init(NAME ## _t * const self, wt_rx14xx_timer_prescale_t const prescale, wt_error_t * const error) { \
        TON = 0; \
        TIMER = 0; \
        TCKPS = prescale; \
        return wthal_timer_init(&self->timer, &NAME ## _impl, self, error); \
    }

//-------------------------

typedef struct {
    uint32_t volatile count;
} wthal_counter_t;

wthal_counter_t * const wthal_counter_init(wthal_counter_t * const self, wt_error_t * const error) {
    self->count = 0;
    return self;
}

bool wthal_counter_reset(wthal_counter_t * const self, wt_error_t * const error) {
    bool ok = true;
    ok = !ok ? ok : wt_assert_ptr(self, error);
    if (ok) {
        self->count = 0;
    }
    return ok;
}

bool wthal_counter_increment(wthal_counter_t * const self, wt_error_t * const error) {
    bool ok = true;
    ok = !ok ? ok : wt_assert_ptr(self, error);
    if (ok) {
        self->count++;
    }
    return ok;
}

uint32_t wthal_counter_get(wthal_counter_t * const self, wt_error_t * const error) {
    bool ok = true;
    ok = !ok ? ok : wt_assert_ptr(self, error);
    return ok ? self->count : 0;
}

void wthal_counter_isr(void * const context) {
    wthal_counter_t * const counter = context;
    wthal_counter_increment(counter, NULL);
}

//-----------------------------------

typedef struct wthal_observer_tag wthal_observer_t;

struct wthal_observer_tag {
    void (*callback)(void * const context);
    void * context;
    wthal_observer_t * volatile next;
    wthal_observer_t * volatile prev;
};

