Wavetrend/RX14XX-TestApp/main.c
bool wthal_gpio_output_drain(wthal_gpio_t * const self, bool const enable) {
    return self->impl->output_drain(self->context, enable);
}

#define DECLARE_GPIO(NAME) \
    typedef struct { \
        wthal_gpio_t gpio; \
    } NAME ## _t; \
    wthal_gpio_t * const NAME ## _init(NAME ## _t * const self);

#define DEFINE_GPIO(NAME, PORT, TRIS, LAT, ANS, WPU, WPD, ODRAIN) \
    DECLARE_GPIO(NAME) \
    static bool NAME ## _set_impl(void * const context, bool const high) { \
        LAT = high; \
        return true; \
    } \
    static bool NAME ## _toggle_impl(void * const context) { \
        return LAT ^= 1; \
    } \
    static bool NAME ## _get_impl(void * const context) { \
        return PORT; \
    } \
    static bool NAME ## _input_impl(void * const context, bool const input) { \
        TRIS = input; \
        return true; \
    } \
    static bool NAME ## _analogue_impl(void * const context, bool const analogue) { \
        ANS = analogue; \
        return true; \
    } \
    static bool NAME ## _weak_pull_up_impl(void * const context, bool const enabled) { \
        WPU = enabled; \
        return true; \
    } \
    static bool NAME ## _weak_pull_down_impl(void * const context, bool const enabled) { \
        WPD = enabled; \
        return true; \
    } \
    static bool NAME ## _output_drain_impl(void * const context, bool const enabled) { \
        ODRAIN = enabled; \
        return true; \
    } \
    static wthal_gpio_impl_t NAME ## _impl = { \
        .set = NAME ## _set_impl, \
        .toggle = NAME ## _toggle_impl, \
        .get = NAME ## _get_impl, \
        .input = NAME ## _input_impl, \
        .analogue = NAME ## _analogue_impl, \
        .weak_pull_up = NAME ## _weak_pull_up_impl, \
        .weak_pull_down = NAME ## _weak_pull_down_impl, \
        .output_drain = NAME ## _output_drain_impl, \
    }; \
    wthal_gpio_t * const NAME ## _init(NAME ## _t * const self) { \
        TRIS = 0; \
        LAT = 0; \
        ANS = 0; \
        WPU = 0; \
        WPD = 0; \
        ODRAIN = 0; \
        return wthal_gpio_init(&self->gpio, &NAME ## _impl, self); \
    }

///////////////////////////////// UART ///////////////////////////////////////

typedef struct {
    
    bool (*open)(void * const context);
    bool (*close)(void * const context);
    bool (*baudrate)(void * const context, uint32_t const baudrate);
    bool (*flowcontrol)(void * const context, bool const flowcontrol);
    size_t (*read)(void * const context, void * const data, size_t const size);
    size_t (*write)(void * const context, void const * const data, size_t const size);
    
} wthal_uart_impl_t;

typedef struct {
    
    wthal_uart_impl_t const * impl;
    void * context;
    
} wthal_uart_t;

wthal_uart_t * const wthal_uart_init(wthal_uart_t * const self, wthal_uart_impl_t const * const impl, void * const context) {
    self->impl = impl;
    self->context = context;
    return self;
}

bool wthal_uart_open(wthal_uart_t * const self) {
    return self->impl->open(self->context);
}

bool wthal_uart_close(wthal_uart_t * const self) {
    return self->impl->close(self->context);
}

bool wthal_uart_baudrate(wthal_uart_t * const self, uint32_t const baudrate) {
    return self->impl->baudrate(self->context, baudrate);
}

bool wthal_uart_flowcontrol(wthal_uart_t * const self, bool const flowcontrol) {
    return self->impl->flowcontrol(self->context, flowcontrol);
}

bool wthal_uart_read(wthal_uart_t * const self, void * const data, size_t const size) {
    return self->impl->read(self->context, data, size);
}

bool wthal_uart_write(wthal_uart_t * const self, void const * const data, size_t const size) {
    return self->impl->write(self->context, data, size);
}

#ifndef UART_TESTING
#define UART_TX_ISR(X)          (_U ## X ## TXInterrupt)
#define UART_RX_ISR(X)          (_U ## X ## RXInterrupt)
#define UART_ERR_ISR(X)         (_U ## X ## ErrInterrupt)
#define UART_TXIE(X)            (_U ## X ## TXIE)
#define UART_TXIF(X)            (_U ## X ## TXIF)
#define UART_TXIP(X)            (_U ## X ## TXIP)
#define UART_RXIE(X)            (_U ## X ## RXIE)
#define UART_RXIF(X)            (_U ## X ## RXIF)
#define UART_RXIP(X)            (_U ## X ## RXIP)
#define UART_ERIE(X)            (_U ## X ## ERIE)
#define UART_ERIF(X)            (_U ## X ## ERIF)
#define UART_ERIP(X)            (_U ## X ## ERIP)
#define UART_TXBF(X)            (U ## X ## STAbits.UTXBF)
#define UART_TXREG(X)           (U ## X ## TXREG)
#define UART_RXREG(X)           (U ## X ## RXREG)
#define UART_STA(X)             (U ## X ## STA)
#define UART_RXDA(X)            (U ## X ## STAbits.URXDA)
#define UART_OERR(X)            (U ## X ## STAbits.OERR)
#define UART_MODE(X)            (U ## X ## MODE)
#define UART_BRGH(X)            (U ## X ## MODEbits.BRGH)
#define UART_BRG(X)             (U ## X ## BRG)
#define UART_UARTEN(X)          (U ## X ## MODEbits.UARTEN)
#define UART_TXEN(X)            (U ## X ## STAbits.UTXEN)
#define UART_EN(X)              (U ## X ## MODEbits.UEN)
#endif /* UART_TESTING */

#define DEFINE_UART(NAME, UART, XTAL) \
    DEFINE_ISR(NAME ## _tx, UART_TX_ISR(UART), UART_TXIF(UART), UART_TXIE(UART), UART_TXIP(UART)); \
    DEFINE_ISR(NAME ## _rx, UART_RX_ISR(UART), UART_RXIF(UART), UART_RXIE(UART), UART_RXIP(UART)); \
    DEFINE_ISR(NAME ## _err, UART_ERR_ISR(UART), UART_ERIF(UART), UART_ERIE(UART), UART_ERIP(UART)); \
    typedef struct { \
        uint32_t baudrate; \
        bool flowcontrol; \
        wthal_uart_t uart; \
        wthal_isr_t * tx_isr; \
        wthal_isr_t * rx_isr; \
        wthal_isr_t * err_isr; \
        NAME ## _tx_t _tx_isr; \
        NAME ## _rx_t _rx_isr; \
        NAME ## _err_t _err_isr; \
        wthal_observer_t tx_observers[1]; \
        wthal_observer_t rx_observers[1]; \
        wthal_observer_t err_observers[1]; \
        wt_rx14xx_uint8_buffer_t tx_buffer; \
        wt_rx14xx_uint8_buffer_t rx_buffer; \
        uint8_t tx_storage[256]; \
        uint8_t rx_storage[256]; \
    } NAME ## _t; \
    static void NAME ## _tx_isr_impl(void * const context) { \
        NAME ## _t * const self = context; \
        while (! UART_TXBF(UART)) { \
            uint8_t data; \
            if (wt_rx14xx_uint8_buffer_read(&self->tx_buffer, &data, sizeof(data), NULL)) { \
                UART_TXREG(UART) = data; \
            } else { \
                wthal_isr_enable(self->tx_isr, false); \
                break; \
            } \
        } \
    } \
    static void NAME ## _rx_isr_impl(void * const context) { \
        NAME ## _t * const self = context; \
        bool ok = true; \
        while (ok && UART_RXDA(UART)) { \
            uint8_t data = UART_RXREG(UART); \
            ok = !ok ? ok : wt_rx14xx_uint8_buffer_write(&self->rx_buffer, &data, sizeof(data), NULL); \
        } \
    } \
    static void NAME ## _err_isr_impl(void * const context) { \
        if (UART_OERR(UART) == 1) { \
            UART_OERR(UART) = 0; \
        } \
    } \
    static bool NAME ## _open_impl(void * const context) { \
        NAME ## _t * const self = context; \
        UART_MODE(UART) = 0x0000; \
        UART_BRGH(UART) = 1; \
        UART_STA(UART) = 0x0000; \
        wthal_uart_baudrate(&self->uart, self->baudrate); \
        wthal_uart_flowcontrol(&self->uart, self->flowcontrol); \
        wthal_isr_enable(self->tx_isr, false); \
        wthal_isr_enable(self->rx_isr, true); \
        wthal_isr_enable(self->err_isr, true); \
        UART_UARTEN(UART) = 1; \
        UART_TXEN(UART) = 1; \
        return true; \
    } \
    static bool NAME ## _close_impl(void * const context) { \
        NAME ## _t * const self = context; \
        wthal_isr_enable(self->tx_isr, false); \
        wthal_isr_enable(self->rx_isr, false); \
        wthal_isr_enable(self->err_isr, false); \
        UART_UARTEN(UART) = 0; \
        UART_TXEN(UART) = 0; \
        return true; \
    } \
    static bool NAME ## _baudrate_impl(void * const context, uint32_t const baudrate) { \
        NAME ## _t * const self = context; \
        self->baudrate = baudrate; \
        UART_BRG(UART) = (XTAL / (4 * self->baudrate)) - 1; \
        return true; \
    } \
    static bool NAME ## _flowcontrol_impl(void * const context, bool const flowcontrol) { \
        NAME ## _t * const self = context; \
        self->flowcontrol = flowcontrol; \
        UART_EN(UART) = self->flowcontrol ? 2 : 0; \
        return true; \
    } \
    static size_t NAME ## _read_impl(void * const context, void * const data, size_t const size) { \
        NAME ## _t * const self = context; \
        return wt_rx14xx_uint8_buffer_read(&self->rx_buffer, data, size, NULL); \
    } \
    static size_t NAME ## _write_impl(void * const context, void const * const data, size_t const size) { \
        NAME ## _t * const self = context; \
        size_t written = wt_rx14xx_uint8_buffer_write(&self->tx_buffer, data, size, NULL); \
        if (written > 0) { \
            wthal_isr_set_flag(self->tx_isr, true); \
            wthal_isr_enable(self->tx_isr, true); \
        } \
        return written; \
    } \
    static wthal_uart_impl_t const NAME ## _impl = { \
        .open = NAME ## _open_impl, \
        .close = NAME ## _close_impl, \
        .baudrate = NAME ## _baudrate_impl, \
        .flowcontrol = NAME ## _flowcontrol_impl, \
        .read = NAME ## _read_impl, \
        .write = NAME ## _write_impl, \
    }; \
    wthal_uart_t * const NAME ## _init(NAME ## _t * const self, uint32_t const baudrate, bool const flowcontrol, wthal_isr_priority_t const tx_priority, wthal_isr_priority_t const rx_priority, wthal_isr_priority_t const err_priority) { \
        self->baudrate = baudrate; \
        self->flowcontrol = flowcontrol; \
        self->tx_isr = NAME ## _tx_init(&self->_tx_isr, tx_priority, self->tx_observers, 1); \
        self->rx_isr = NAME ## _rx_init(&self->_rx_isr, rx_priority, self->rx_observers, 1); \
        self->err_isr = NAME ## _err_init(&self->_err_isr, err_priority, self->err_observers, 1); \
        wthal_isr_add_observer(self->tx_isr, NAME ## _tx_isr_impl, self); \
        wthal_isr_add_observer(self->rx_isr, NAME ## _rx_isr_impl, self); \
        wthal_isr_add_observer(self->err_isr, NAME ## _err_isr_impl, self); \
        wt_rx14xx_uint8_buffer_init(&self->tx_buffer, self->tx_storage, 256, NULL); \
        wt_rx14xx_uint8_buffer_init(&self->rx_buffer, self->rx_storage, 256, NULL); \
        return wthal_uart_init(&self->uart, &NAME ## _impl, self); \
    }

